In [1]:
import pandas as pd
import numpy as np

In [3]:
d ={'a':[1,2,4],'b':[np.nan,4,6],'c':[9,np.nan,4]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

   a    b    c
0  1  NaN  9.0
1  2  4.0  NaN
2  4  6.0  4.0

In [6]:
df.dropna() # it drops entire null value row

   a    b    c
2  4  6.0  4.0

In [7]:
df

   a    b    c
0  1  NaN  9.0
1  2  4.0  NaN
2  4  6.0  4.0

In [8]:
df.dropna(axis=1)

   a
0  1
1  2
2  4

In [13]:
df.fillna(value='jp')

   a   b   c
0  1  jp   9
1  2   4  jp
2  4   6   4

In [14]:
df

   a    b    c
0  1  NaN  9.0
1  2  4.0  NaN
2  4  6.0  4.0

In [17]:
df['b'].fillna(value=df['a'].mean(),inplace =True)

In [18]:
df

   a         b    c
0  1  2.333333  9.0
1  2  4.000000  NaN
2  4  6.000000  4.0